{
  "products": [
    {
      "title": "Искусство войны",
      "author": "Сунь-Цзы",
      "img": "https://covers.openlibrary.org/b/id/7883930-L.jpg",
      "category": [
        "История",
        "Философия"
      ],
      "numberOfPages": 215,
      "price": 680,
      "description": "«Искусство войны» — древний китайский военный трактат, датируемый периодом Поздней Весны и Осени. Работа, которую приписывают древнему китайскому военному стратегу Сунь Цзы",
      "id": "1"
    },
    {
      "title": "Критика чистого разума",
      "author": "Иммануил Кант",
      "img": "https://ia600606.us.archive.org/view_archive.php?archive=/21/items/olcovers66/olcovers66-L.zip&file=662241-L.jpg",
      "category": [
        "История",
        "Философия"
      ],
      "numberOfPages": 1030,
      "price": 1255,
      "description": "Один из центральных текстов западной философии и попытка связать ньютоновскую физику с лучшими проявлениями континентального рационализма и эмпиризма. Его написание было вдохновлено скептиком Дэвидом Юмом, пробудившим Канта от его «догматического сна».",
      "id": "2"
    },
    {
      "title": "Золотой жук",
      "author": "Эдгар Аллан По",
      "img": "https://covers.openlibrary.org/b/id/11851580-L.jpg",
      "category": [
        "Детектив"
      ],
      "numberOfPages": 480,
      "price": 280,
      "description": "Обнаружение сообщения в коде на береговой линии, ранее кишащей пиратами, отправляет Уильяма Леграна и его друзей на охоту за закопанными сокровищами.",
      "id": "3"
    },
    {
      "title": "Убийство на улице Морг",
      "author": "Эдгар Аллан По",
      "img": "https://covers.openlibrary.org/b/id/11683075-L.jpg",
      "category": [
        "Детектив"
      ],
      "numberOfPages": 288,
      "price": 450,
      "description": "Рассказ американского писателя-романтика Эдгара Аллана По, который принято считать первым детективным произведением в истории литературы",
      "id": "4"
    },
    {
      "title": "Цвет из иных миров",
      "author": "Говард Филлипс Лавкрафт",
      "img": "https://ia801602.us.archive.org/view_archive.php?archive=/11/items/olcovers647/olcovers647-L.zip&file=6477984-L.jpg",
      "category": [
        "Ужас",
        "Фантастика",
        "Мистика"
      ],
      "numberOfPages": 222,
      "price": 160,
      "description": "Произведение описывает ужасные события, случившиеся с семьёй американских фермеров после падения загадочного метеорита",
      "id": "5"
    },
    {
      "title": "Хребты безумия",
      "author": "Говард Филлипс Лавкрафт",
      "img": "https://covers.openlibrary.org/b/id/8259841-L.jpg",
      "category": [
        "Ужас",
        "Фантастика",
        "Мистика"
      ],
      "numberOfPages": 608,
      "price": 750,
      "description": "История описывает события катастрофической экспедиции ученых в Антарктиду в сентябре 1930 года, которая обнаружила останки древней цивилизации, более древней, чем человечество, и осознание доисторического прошлого Земли",
      "id": "6"
    },
    {
      "id": "7",
      "img": "https://covers.openlibrary.org/b/id/10579087-L.jpg",
      "title": "Тень над Иннсмутом",
      "description": "«Тень над Иннсмутом» — новелла ужасов и единственный рассказ Лавкрафта, опубликованный в виде книги при его жизни. Рассказчик - студент, совершающий антикварный тур по Новой Англии. Он едет в Иннсмут, общается со странными людьми и наблюдает за тревожными событиями, которые в конечном итоге приводят к ужасающим и личным откровениям.",
      "author": "Говард Филлипс Лавкрафт",
      "numberOfPages": 100,
      "category": [
        "Ужас",
        "Фантастика",
        "Мистика"
      ],
      "price": 600
    },
    {
      "id": "8",
      "img": "https://ia800609.us.archive.org/view_archive.php?archive=/10/items/olcovers572/olcovers572-L.zip&file=5722094-L.jpg",
      "title": "Божественная Комедия",
      "description": "Поэтический шедевр Данте Алигьери «Божественная комедия» (итал. Divina Commedia), принадлежащий к бессмертной компании великих произведений литературы, представляет собой волнующую человеческую драму, незабываемое фантастическое путешествие через бесконечные муки ада, вверх по трудным склонам Чистилища. , и далее в славное царство Рая — сферу всеобщей гармонии и вечного спасения.",
      "author": "Данте Алигьери",
      "numberOfPages": 800,
      "category": [
        "История",
        "Религия",
        "Поэзия"
      ],
      "price": 350
    },
    {
      "id": "9",
      "img": "https://covers.openlibrary.org/b/id/12736548-L.jpg",
      "title": "Ворон",
      "description": "Поэма американского писателя Эдгара Аллана По. Поэма, впервые опубликованная в январе 1845 года, часто известна своей музыкальностью, стилизованным языком и сверхъестественной атмосферой. В нем рассказывается о таинственном визите говорящего ворона к обезумевшему любовнику, прослеживая медленное схождение человека с ума.",
      "author": "Эдгар Аллан По",
      "numberOfPages": 290,
      "category": [
        "Поэзия"
      ],
      "price": 450
    },
    {
      "id": "10",
      "img": "https://covers.openlibrary.org/b/id/11172296-L.jpg",
      "title": "Десять негритят",
      "description": "Детективный роман английской писательницы Агаты Кристи, который она назвала самой трудной для написания из своих книг. Впервые он был опубликован в Соединенном Королевстве Криминальным клубом Коллинза 6 ноября 1939 года под названием « Десять маленьких негров» после детской считалки и песни менестреля, которая служит основным элементом сюжета.",
      "author": "Агата Кристи",
      "numberOfPages": 288,
      "category": [
        "Детектив"
      ],
      "price": 225
    },
    {
      "id": "11",
      "img": "https://covers.openlibrary.org/b/id/10247228-L.jpg",
      "title": "Ночь без конца",
      "description": "Gipsy's Acre — это действительно красивое место на возвышенности с видом на море, и для Майкла Роджерса оно пробуждает детскую фантазию. Он хочет поселиться там, среди темных елей. Тем не менее, когда он покидает деревню, над землей нависает тень угрозы. Это место, где происходят несчастные случаи. Возможно, Майклу стоило прислушаться к предостережениям местных жителей: «Нет удачи им, поскольку они влезают в Gipsy's Acre».",
      "author": "Агата Кристи",
      "numberOfPages": 320,
      "category": [
        "Детектив"
      ],
      "price": 405
    },
    {
      "id": "12",
      "img": "https://covers.openlibrary.org/b/id/10249507-L.jpg",
      "title": "Труп в библиотеке",
      "description": "Весьма респектабельный полковник и миссис Бэнтри проснулись и обнаружили в своей библиотеке тело молодой женщины. На ней вечернее платье и тяжелый макияж, который теперь размазан по холодным щекам. Но кто она? Как она туда попала? И какая у нее связь с другой погибшей девушкой, обгоревшие останки которой позже обнаруживают в заброшенной каменоломне? Бэнтри обращаются к мисс Марпл, чтобы разгадать тайну.",
      "author": "Агата Кристи",
      "numberOfPages": 288,
      "category": [
        "Детектив"
      ],
      "price": 825
    },
    {
      "id": "13",
      "img": "https://covers.openlibrary.org/b/id/10249130-L.jpg",
      "title": "Убийства по алфавиту",
      "description": "Серийный убийца на свободе, помешанный на том, чтобы проложить себе путь через алфавит. И в качестве жуткой визитной карточки он оставляет рядом с трупом каждой жертвы железнодорожный справочник ABC, открытый на названии города, где произошло убийство. Начав с Андовера, Бексхилла, а затем и Черстона, шансы на поимку убийцы невелики, пока он не совершит решающую и напрасную ошибку, бросив вызов Эркюлю Пуаро, чтобы разрушить его планы.",
      "author": "Агата Кристи",
      "numberOfPages": 320,
      "category": [
        "Детектив"
      ],
      "price": 525
    },
    {
      "id": "14",
      "img": "https://covers.openlibrary.org/b/id/10375596-L.jpg",
      "title": "Убийство в «Восточном экспрессе»",
      "description": "По пути из Сирии в Париж посреди морозной зимней ночи Восточный экспресс застревает в сугробе. Пассажиры просыпаются и обнаруживают, что поезд все еще стоит на мели, и обнаруживают, что богатый американец был жестоко зарезан в своем личном купе. Невероятно, но этот отсек заперт изнутри. Без выхода в зимний пейзаж убийца должен быть на борту. К счастью, блестящий бельгийский инспектор Эркюль Пуаро также находится на борту, забронировав последнее свободное место.",
      "author": "Агата Кристи",
      "numberOfPages": 318,
      "category": [
        "Детектив"
      ],
      "price": 755
    },
    {
      "id": "15",
      "img": "https://covers.openlibrary.org/b/id/12374783-L.jpg",
      "title": "Зов Ктулху",
      "description": "Рассказ Г.Ф. Лавкрафта в жанре лавкрафтовских ужасов, написанный в 1926 году. В нём впервые появляется Ктулху — божество, которому поклоняются адепты жестокого культа",
      "author": "Говард Филлипс Лавкрафт",
      "numberOfPages": 416,
      "category": [
        "Ужас",
        "Фантастика",
        "Мистика"
      ],
      "price": 685
    },
    {
      "title": "Загадка Эндхауза",
      "author": "Агата Кристи",
      "img": "https://covers.openlibrary.org/b/id/10249680-L.jpg",
      "category": [
        "Детектив"
      ],
      "numberOfPages": 275,
      "price": 455,
      "description": "Ник — необычное имя для симпатичной молодой женщины. А Ник Бакли в последнее время ведет необычную жизнь. Во-первых, на коварном склоне Корнуолла у ее машины отказывают тормоза. Затем на прибрежной тропе падающий валун промахивается мимо нее в нескольких дюймах. В безопасности в постели, она почти раздавлена ​​картиной. Обнаружив дырку от пули в шляпе Ника от солнца, Эркюль Пуаро (приехавший в Корнуолл на простой отдых со своим другом капитаном Гастингсом) решает, что девушке нужна его защита. В то же время он начинает разгадывать тайну несовершенного убийства.",
      "id": "16"
    },
    {
      "id": "17",
      "img": "https://ia800603.us.archive.org/view_archive.php?archive=/27/items/olcovers649/olcovers649-L.zip&file=6493390-L.jpg",
      "title": "Ужас Данвича",
      "description": "Второго февраля 1913 года у Лавинии Уэйтли родился сын Уилбур. Странный мальчик, который рос не по дням, а по часам, внушал страх жителям Данвича. Его деда считали колдуном, а сам он пропадал в библиотеке Мискатоникского университета, где выискивал в черных книгах сведения о магических формулах и заклинаниях. Однако все это – только пролог к ужасу Данвича.",
      "author": "Говард Филлипс Лавкрафт",
      "numberOfPages": 96,
      "category": [
        "Ужас",
        "Фантастика",
        "Мистика"
      ],
      "price": 805
    },
    {
      "id": "18",
      "img": "https://covers.openlibrary.org/b/id/10587137-L.jpg",
      "title": "Властелин колец. Хранители кольца",
      "description": "«Хранители кольца» — первый том трилогии «Властелин колец» — повествует о роковой силе Единого Кольца и начинает великолепную историю приключений, которая продолжается в «Двух башнях» и достигает своего могучего апогея в «Возвращение короля».",
      "author": "Джон Рональд Руэл Толкин",
      "numberOfPages": 460,
      "category": [
        "Фэнтези"
      ],
      "price": 415
    },
    {
      "title": "Властелин колец. Две твердыни",
      "author": "Джон Рональд Руэл Толкин",
      "img": "https://covers.openlibrary.org/b/id/8478088-L.jpg",
      "category": [
        "Фэнтези"
      ],
      "numberOfPages": 480,
      "price": 395,
      "description": "«Властелин колец» — великая трехтомная эпопея Дж. Р. Р. Толкина, действие которой происходит в воображаемом мире Третьей эпохи Средиземья — мире, населенном множеством странных существ, в том числе хоббитами, древним народом меньше гномов, веселым, миролюбивым и застенчивый. С момента своей первой публикации эта работа захватила воображение читателей всех возрастов и слоев общества.",
      "id": "19"
    },
    {
      "id": "20",
      "img": "https://covers.openlibrary.org/b/id/12530135-L.jpg",
      "title": "Властелин колец. Возвращение короля",
      "description": "Возвращение Короля, завершающее великую эпопею о войне и приключениях, начатую в «Хранители кольца» и продолженную в «Двух башнях», является третьей и последней частью шедевра Дж. Р. Р. Толкина «Властелин колец».",
      "author": "Джон Рональд Руэл Толкин",
      "numberOfPages": 416,
      "category": [
        "Фэнтези"
      ],
      "price": 365
    }
  ],
  "categories": [
    {
      "id": "Фантастика",
      "categoryName": "Фантастика"
    },
    {
      "id": "Ужас",
      "categoryName": "Ужас"
    },
    {
      "id": "Фэнтези",
      "categoryName": "Фэнтези"
    },
    {
      "id": "Мистика",
      "categoryName": "Мистика"
    },
    {
      "id": "Детектив",
      "categoryName": "Детектив"
    },
    {
      "id": "История",
      "categoryName": "История"
    },
    {
      "id": "Религия",
      "categoryName": "Религия"
    },
    {
      "id": "Поэзия",
      "categoryName": "Поэзия"
    },
    {
      "id": "Философия",
      "categoryName": "Философия"
    }
  ]
}